InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Constants/НастройкиСканированияКодовМаркировкиИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать настройки сканирования.
// 
// Параметры:
//  ПараметрКонтроля - Строка: см. НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля
//  ГруппаПараметров - см. НастройкаПараметровСканированияСлужебныйКлиентСервер.ЗначениеГруппыНастроек
Процедура ЗаписатьГруппуНастроекСканирования(ПараметрКонтроля, ГруппаПараметров) Экспорт
	
	ПараметрыКонтроля = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля();
	
	Если ПараметрКонтроля = ПараметрыКонтроля.ПараметрыИгнорированияПроверкиККТ Тогда
		ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ИгнорироватьРезультатыПроверкиКодовМаркировкиНаККТ;
		ВидыПродукции       = КонструкторИСОбщегоНазначенияКлиентСервер.УчитываемыеВидыПродукцииИСМП(Истина);
	ИначеЕсли ПараметрКонтроля = ПараметрыКонтроля.ПараметрыКонтроляСтатусов Тогда
		ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.КонтролироватьСтатусыКодовМаркировки;
		ВидыПродукции       = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМП(Истина);
	ИначеЕсли ПараметрКонтроля = ПараметрыКонтроля.ПараметрыКонтроляВладельцев Тогда
		ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.КонтролироватьВладельцевКодовМаркировки;
		ВидыПродукции       = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМП(Истина);
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыЭлементаКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(ЭлементКонструктора);
	ДоступныеОперации             = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ДопустимыеВидыОпераций()[ПараметрКонтроля];
	РодительскиеОперации          = Новый Соответствие;
	
	Для Каждого ВидОперации Из ДоступныеОперации Цикл
		ОперацияПроверки = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ОперацияКонтроляСтатусовВладельцев(ВидОперации);
		РодительскиеОперации.Вставить(ОперацияПроверки, Истина);
	КонецЦикла;
	
	Таблица = РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ИнициализироватьТаблицуДанных();
	
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		
		ИсключенияПоВидуПродукци = ГруппаПараметров.Исключения[ВидПродукции];
		
		Для Каждого КлючИЗначение Из РодительскиеОперации Цикл
			
			ОперацияПроверки = КлючИЗначение.Ключ;
			
			Если ГруппаПараметров.РежимИсключения Тогда
				
				Если ИсключенияПоВидуПродукци = Неопределено Тогда
					Продолжить; // для вида продукции не заданы исключения
				ИначеЕсли ИсключенияПоВидуПродукци.Количество() > 0 // для вида продукции указаны операции (т.е. не для всех операций)
					И ИсключенияПоВидуПродукци[ОперацияПроверки] = Неопределено Тогда // текущая операция не указана
					Продолжить;
				КонецЕсли;
				
				// операция задана явно или для вида продукции все операции
				
				Действует = КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
					ЭлементКонструктора,
					ВидПродукции,
					ОперацияПроверки);
				Если Не Действует Тогда
					Продолжить; // в поставляемых данных классификатора операция отключена
				КонецЕсли;
				
				// в поставляемых данных классификатора операция включена, но настроено исключение пользователем
				
				СвязанныйЭлемент = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначениеАтрибутаЭлементаКонструктора(
					"СвязанныйЭлемент", ЭлементКонструктора, ВидПродукции, ОперацияПроверки);
				Если ЗначениеЗаполнено(СвязанныйЭлемент) Тогда
					Продолжить; // Пользователем настроено исключение по элементу, имеющему связь с датой
				КонецЕсли;
				
				ЗначениеУстановлено = Ложь;
				
			Иначе
				ЗначениеУстановлено = Истина;
				Если ГруппаПараметров.Исключения.Количество() > 0 // действует не для всех видов продукции
					И (ИсключенияПоВидуПродукци = Неопределено // для вида продукции не заданы настройки
						Или ИсключенияПоВидуПродукци.Количество() > 0 // для вида продукции указаны операции (т.е. не для всех операций)
							И ИсключенияПоВидуПродукци[ОперацияПроверки] = Неопределено) Тогда // текущая операция не указана
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаТЧ = Таблица.Добавить();
			СтрокаТЧ.ВидПродукции        = ВидПродукции;
			СтрокаТЧ.ЭлементКонструктора = ЭлементКонструктора;
			СтрокаТЧ.Параметризуется     = ПараметрыЭлементаКонструктора.Параметризуется;
			СтрокаТЧ.Значение            = ОперацияПроверки;
			СтрокаТЧ.ЗначениеУстановлено = ЗначениеУстановлено;
			СтрокаТЧ.КаждомуВидуПродукцииСоответствуетОдноЗначение = ПараметрыЭлементаКонструктора.КаждомуВидуПродукцииСоответствуетОдноЗначение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ЗаписатьДанные(Таблица);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьНастройкиСканированияПриПереходеНаКонструкторНастроек() Экспорт
	
	Если ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС()
		И ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИС").УпрощеннаяИнтеграцияБЭД() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКонстанты   = Константы.НастройкиСканированияКодовМаркировкиИСМП.Получить().Получить();
	ПараметрыКонтроля = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля();
	КешКонвертаций    = ОбновлениеИнформационнойБазыГосИС.КешКонвертацийВидаПродукции();
	
	Если ДанныеКонстанты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКонстанты.Свойство("ПараметрыКонтроляСтатусов") Тогда
			
		ГруппаНастроек = НастройкаПараметровСканированияСлужебныйКлиентСервер.НоваяГруппаПараметровНастройки();
		ЗаполнитьЗначенияСвойств(ГруппаНастроек, ДанныеКонстанты.ПараметрыКонтроляСтатусов);
		
		Если ГруппаНастроек.Включено Тогда
			КонвертироватьВидПродукцииВСправочник(ГруппаНастроек.Исключения, КешКонвертаций);
			ЗаписатьГруппуНастроекСканирования(ПараметрыКонтроля.ПараметрыКонтроляСтатусов, ГруппаНастроек);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеКонстанты.Свойство("ПараметрыКонтроляВладельцев") Тогда
		
		ГруппаНастроек = НастройкаПараметровСканированияСлужебныйКлиентСервер.НоваяГруппаПараметровНастройки();
		ЗаполнитьЗначенияСвойств(ГруппаНастроек, ДанныеКонстанты.ПараметрыКонтроляВладельцев);
		
		Если ГруппаНастроек.Включено Тогда
			КонвертироватьВидПродукцииВСправочник(ГруппаНастроек.Исключения, КешКонвертаций);
			ЗаписатьГруппуНастроекСканирования(ПараметрыКонтроля.ПараметрыКонтроляВладельцев, ГруппаНастроек);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеКонстанты.Свойство("ПараметрыИгнорированияПроверкиККТ")
		И Не ДанныеКонстанты.ПропускатьПроверкуСредствамиККТ Тогда
		
		ГруппаНастроек = НастройкаПараметровСканированияСлужебныйКлиентСервер.НоваяГруппаПараметровНастройки(Ложь);
		ЗаполнитьЗначенияСвойств(ГруппаНастроек, ДанныеКонстанты.ПараметрыИгнорированияПроверкиККТ);
		
		Если ГруппаНастроек.Включено Тогда
			КонвертироватьВидПродукцииВСправочник(ГруппаНастроек.Исключения, КешКонвертаций);
			ЗаписатьГруппуНастроекСканирования(ПараметрыКонтроля.ПараметрыИгнорированияПроверкиККТ, ГруппаНастроек);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура КонвертироватьВидПродукцииВСправочник(Исключения, КешКонвертаций)
	
	Если Исключения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Ключи = Новый Массив;
	
	Для Каждого КлючИЗначение Из Исключения Цикл
		
		ВидПродукцииПеречисление = КлючИЗначение.Ключ;
		Значение                 = КлючИЗначение.Значение;
		
		Если ТипЗнч(ВидПродукцииПеречисление) = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(ВидПродукцииПеречисление) = Тип("ПеречислениеСсылка.ВидыОперацийИСМП") Тогда
			Ключи.Добавить(ВидПродукцииПеречисление);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидПродукцииПеречисление) Тогда
			ВидПродукции = ОбновлениеИнформационнойБазыИСМП.ВидПродукцииГИСМТПоПеречислению(ВидПродукцииПеречисление, КешКонвертаций);
		Иначе
			ВидПродукции = Справочники.ВидыПродукцииИС.ПустаяСсылка();
		КонецЕсли;
		
		Ключи.Добавить(ВидПродукцииПеречисление);
		Исключения.Вставить(ВидПродукции, Значение);
		
	КонецЦикла;
	
	Для Каждого Ключ Из Ключи Цикл
		Исключения.Удалить(Ключ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
